Catalogs/сабОтпускаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>сабОтпускаСотрудников</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замещающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоЗамещающих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательСогласовал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗамещающийСогласовал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьПользователей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНовости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЗамещающего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехническийОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтсутствия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелегироватьЗадачиНаПодчиненных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДелегирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеАвтомаршрутизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускникОтсутствуетВБазе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОтпускник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникЗамещающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопСогласование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СубъектСогласования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пройден</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарииПользователя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольПользователя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаршрутДвижения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДвиженияЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оповещение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Замещающие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗамПользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/БП_ТекущийСтатус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>БП_ТекущийСтатус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетНаМесте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОтпуске</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уволен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/сабОтпускаСотрудников/Forms/ФормаЗамещающего/Ext/Form/Module.bsl
&НаКлиенте
Процедура Принять(Команда)
	
	Если Не БПСервер.ПроверкаЗадачи(Объект.Ссылка) Тогда
		ПринятьСервер(Истина);
		ОчиститьПредприятия();
		ЗаписатьНаСервере(Комментарий);
		//СписокПредприятий = БюджетныйНаСервере.ПолучитьПредприятия();
		//
		//УстановитьДоступныеПП(СписокПредприятий);
		
		Если ДатаНачала <= ТекущаяДата() Тогда
			БюджетныйНаСервере.УстановитьПользователя(Замещающий,, Истина);
		КонецЕсли;
		
		ОповеститьОбИзменении(Тип("ЗадачаСсылка.Задача"));
		Оповестить("ОбновитьСписокЗадач");
		Закрыть();
	КонецЕсли;
	
	Замещ = БюджетныйНаСервере.ВернутьРеквизит(Ссылка, "Замещающий");
	Отпускн = БюджетныйНаСервере.ВернутьРеквизит(Ссылка, "Пользователь"); 
	
	ТекстСообщения = "Замещающий " + Замещ + " принял обязанности пользователя " + Отпускн;
	БПСервер.СоздатьОповещение(БюджетныйНаСервере.ВернутьРеквизит(Ссылка, "Пользователь"), ТекстСообщения, "Принятие обязанностей замещающим"); 
	
	УстановитьДоступностьФайловТекущихЗадач(Отпускн);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьДоступностьФайловТекущихЗадач(Отпускник)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Задача.Заявка КАК Заявка,
	|	Задача.БизнесПроцесс КАК БизнесПроцесс
	|ИЗ
	|	Задача.Задача КАК Задача
	|ГДЕ
	|	Задача.Выполнена = ЛОЖЬ
	|	И Задача.Исполнитель = &Исполнитель
	|	И Задача.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	Задача.Заявка,
	|	Задача.БизнесПроцесс";
	
	Запрос.УстановитьПараметр("Исполнитель", Отпускник);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.БизнесПроцесс) Тогда
			БПСервер.БППриЗаписиПриЗаписи(Выборка.БизнесПроцесс.ПолучитьОбъект(), Ложь);		
		КонецЕсли;		
	КонецЦикла;	
	

КонецПроцедуры


&НаСервереБезКонтекста
Процедура УстановитьДоступныеПП(СписокПредприятий)
	ПараметрыСеанса.ДоступныеПользователи = Новый ФиксированныйМассив(СписокПредприятий);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОчиститьПредприятия()
	ПараметрыСеанса.ДоступныеПредприятия = Новый ФиксированныйМассив(Новый Массив);
КонецПроцедуры


&НаСервере
Процедура ПринятьСервер(РезультатЗамещения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Задача.Ссылка
	|ИЗ
	|	Задача.Задача КАК Задача
	|ГДЕ
	|	Задача.Заявка = &Заявка
	|	И Задача.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	Запрос.УстановитьПараметр("Исполнитель", Замещающий);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		БПСервер.ВыполнитьЗадачу(Выборка.Ссылка,0, ?(РезультатЗамещения, "Да", "Нет"), Комментарий);	
		
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда, Комментарий)
	Если Не БПСервер.ПроверкаЗадачи(Объект.Ссылка) Тогда
		
		ПринятьСервер(Ложь);
		СоздатьЗадачуОтмены();
		
		ОповеститьОбИзменении(Тип("ЗадачаСсылка.Задача"));
		Оповестить("ОбновитьСписокЗадач");
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьЗадачуОтмены()
	Задача = Задачи.Задача.СоздатьЗадачу();		
	Задача.Заявка = Ссылка;
	Задача.Дата = ТекущаяДата();
	Задача.Наименование = "Отпуск отклонен пользователем " + Строка(БюджетныйНаСервере.ПолучитьПользователя()) + ". Причина: " + Комментарий;
	Задача.Автор = БюджетныйНаСервере.ПолучитьПользователя();
	Задача.Описание = Примечания;
	Задача.Комментарии = Комментарий;
	Задача.Исполнитель = Пользователь;
	Задача.Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере(Комментарий)
	
	ЭтаЗадачаОбъект = Ссылка.ПолучитьОбъект();
	ЭтаЗадачаОбъект.ЗамещающийСогласовал = Истина;
	ЭтаЗадачаОбъект.КомментарийЗамещающего = Комментарий;
	ЭтаЗадачаОбъект.Записать();
	
	БПСервер.ЗаписатьТекущийСтатус(Перечисления.БП_ТекущийСтатус.ВОтпуске, Пользователь, , ТекущаяДата());
	БПСервер.ЗаписатьТекущийСтатус(Перечисления.БП_ТекущийСтатус.НаРаботе, Пользователь, , ДатаОкончания);

КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураДанных = БюджетныйНаСервере.ВернутьРеквизиты(Объект.Заявка, "Пользователь, Замещающий, ДатаНачала, ДатаОкончания, Примечания");
	
	Пользователь = СтруктураДанных.Пользователь;
	Замещающий = СтруктураДанных.Замещающий;
	ДатаНачала = СтруктураДанных.ДатаНачала;
	ДатаОкончания = СтруктураДанных.ДатаОкончания;
	Примечания = СтруктураДанных.Примечания;
	Ссылка = Объект.Заявка;

КонецПроцедуры
